app/Controllers/Buku.php

    public function simpan()
    {
        if ($this->validate([
            'judul' => [
                'rules' => 'required',
                'errors' => [
                    'required' => '{field} harus diisi'
                ]
            ],
            'sampul' => [
                'rules' => 'uploaded[sampul]|max_size[sampul,10000]|is_image[sampul]|mime_in[sampul,image/jpg,image/jpeg,image/png]',
                'errors' => [
                    'uploaded' => 'Gambar Wajib Dipilih',
                    'max_size' => 'Ukuran gambar terlalu besar',
                    'is_image' => 'File Wajib Gambar',
                    'mime_in' => 'Tipe File Gambar Tidak Sesuai'
                ]
            ]
        ])) {
            $filesampul = $this->request->getFile('sampul');
            $filesampul->move('img');
            $nmsampul = $filesampul->getName();

            $this->Bukumodel->save([
                'judul' => $this->request->getVar('judul'),
                'pengarang' => $this->request->getVar('pengarang'),
                'penerbit' => $this->request->getVar('penerbit'),
                'tahun_terbit' => $this->request->getVar('tahun'),
                'sampul' => $nmsampul
            ]);
---
INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`, `sampul`) VALUES ('Belajar Web', 'wawan', 'Air', '2012', 'pemrograman_3.png')

    public function hapus($idbuku)
    {
        $this->Bukumodel->delete($idbuku);
---
DELETE FROM `buku`
WHERE `id_buku` IN ('9')

    public function update($idbuku)
    {
        if ($this->validate([
            'judul' => [
                'rules' => 'required',
                'errors' => [
                    'required' => '{field} harus diisi'
                ]
            ],
            'sampul' => [
                'rules' => 'max_size[sampul,10000]|is_image[sampul]|mime_in[sampul,image/jpg,image/jpeg,image/png]',
                'errors' => [
                    'max_size' => 'Ukuran gambar terlalu besar',
                    'is_image' => 'File Wajib Gambar',
                    'mime_in' => 'Tipe File Gambar Tidak Sesuai'
                ]
            ]
        ])) {
            $filesampul = $this->request->getFile('sampul');
            if ($filesampul->getError() == 4) {
                $nmsampul = $this->request->getVar('sampulLama');
            } else {
                $nmsampul = $filesampul->getName();
                $filesampul->move('img', $nmsampul);
            }

            $this->Bukumodel->save([
                'id_buku' => $idbuku,
                'judul' => $this->request->getVar('judul'),
                'pengarang' => $this->request->getVar('pengarang'),
                'penerbit' => $this->request->getVar('penerbit'),
                'tahun_terbit' => $this->request->getVar('tahun'),
                'sampul' => $nmsampul
            ]);
---
UPDATE `buku` SET `judul` = 'belajar web', `pengarang` = 'Bambang', `penerbit` = 'Dicoding', `tahun_terbit` = '2017', `sampul` = 'web.jpg'
WHERE `buku`.`id_buku` IN ('1')